   %% 机器人参数设置
   clc;
   % 连杆长度 a (mm)
   a = [0, 0, 294.279, -50, 0, 0];

   % 连杆偏距 d (mm)
   d = [313, 0, 0, 290, -136, 103.5];

   % 连杆扭角 alpha (rad)
   alpha = deg2rad([0, -90, 180, -90, 90, -90]);

   % 关节角偏置(rad)
   offset = deg2rad([0, -80.2175, -80.2175, 0, 0, 0]);
   % 关节限制（角度）
   joint_limits = [-170, 170;    % 轴1关节限制
      -105, 145;    % 轴2关节限制
      -210, 70;     % 轴3关节限制
      -270, 270;    % 轴4关节限制
      -135, 135;    % 轴5关节限制
      -360, 360];   % 轴6关节限制
   % 将关节限制从角度转换为弧度
   joint_limits_rad = deg2rad(joint_limits);

   % 转换为米（MATLAB Robotics Toolbox默认单位为米）
   a = a/1000;
   d = d/1000;

   % 创建连杆对象
   L = Link.empty(0, 6);
   % 机器人参数定义

   % 1. 连杆质量 (kg)
   % masses = [2.520, 3.333, 1.640, 1.882, 1.507, 0.634];
   masses = [2.52, 3.268, 1.662, 1.882, 1.507, 0.634];
   % 2. 加载连杆重心和惯性矩阵(mm)
   load("new_link.mat");
   % 4. 电机转子惯量 (kg·mm²)
   % motor_inertia = [818438.4, 818438.4, 818438.4, 228890.0, 228890.0, 228890.0];
  % % 传动比
  %  reduction_ratio = [120, -120, -120, 100, -100, 100];  % 正负号表示旋转方向
   % 5. 摩擦力参数
   % 三次摩擦力参数
   cubic_coeffs = [
      [-0.321, -0.617, 4.062, -2.815];    % 关节1
      [0.293, -1.872, 7.057, 2.095];      % 关节2
      [0.294, 1.953, 6.304, -2.274];      % 关节3
      [-0.773, 2.265, 2.003, 4.859];      % 关节4
      [-0.288, -0.402, 3.444, -2.135];    % 关节5
      [0.529, -2.824, 7.066, 2.552]       % 关节6
      ];

   % %线性回归拟合
   % 定义摩擦力矩模型参数结构体
   friction_params = struct();

      % 粘性摩擦系数 fv (单位: N·m·s/rad)
   friction_params.viscous = [6.125309, 2.761982, 6.139902, 2.108015, 3.326759, 2.385368];

   % 库仑摩擦系数 fc (单位: N·m)
   friction_params.Coulomb = [2.477309, 3.569074, 2.364363, 1.3494, 1.290929, 1.169381];

   % 偏置摩擦项 fo (单位: N·m)
   friction_params.offset = [-0.305764, 1.247898, 0.235496, 0.073719, -0.267142, 0.046528];

   for i = 1:6
      % 使用改进DH参数法，并添加关节偏移
      L(i) = Link('d', d(i), 'a', a(i), 'alpha', alpha(i), 'offset', offset(i), 'modified');
      
      % 设置关节限制
      L(i).qlim = joint_limits_rad(i, :); 
      
      % 设置连杆质量、质心和惯性矩阵
      L(i).m = masses(i);
      L(i).r = new_link_cogs{i}/1000;  % 转换为米
      L(i).I = new_link_inertia{i}/1e6;  % 转换为 kg·m²
      
      % 摩擦力参数
      L(i).B = friction_params.viscous(i);
      L(i).Tc = friction_params.Coulomb(i);
      
      % %电机惯性
      % L(i).Jm =  motor_inertia(i)/1e6;
      % L(i).G = 1/reduction_ratio(i) ;
   end

   % 创建机器人对象
   robot = SerialLink(L, 'name', '六轴工业机器人');
   % 设置重力方向
   robot.gravity = [0 0 9.81];  % 重力加速度方向设为Z轴负方向